---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.BendDiameterDimensionType
source: html/a0bbd398-56d2-7aa0-2c29-bebdf6cd8306.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.BendDiameterDimensionType Property

Identifies what type of bend diameter dimensions will be shown (radial or diameter).

## Syntax (C#)
```csharp
public BendingDetailBendDiameterDimensionType BendDiameterDimensionType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration